<center><h2><strong><font color="blue"> Advanced Programming for Data Science (APDS)</font></strong></h2></center>

<center><img alt="" src="images/covers/taudata-cover.jpg"/></center>

<center><h2><strong><font color="blue">APDS-05: Introduction to Pandas for Data Science</font></strong></h2></center>

<b><center><h3>(C) Taufik Sutanto</h3></center>
* .

In [39]:
!pip install pandas seaborn numpy matplotlib --q

In [40]:
# Importing Some Python Modules
import warnings; warnings.simplefilter('ignore')
import pandas as pd, numpy as np, seaborn as sns
import matplotlib.pyplot as plt

np.random.seed(420)

# <center><font color="blue"> Pandas Dataframe</font></center>

<center><img alt="" src="images/pandas_dataframe_structure.jpg" style="height: 350px;" /></center>

* Pandas Dataframe dapat dibentuk dari **Dictionary** atau **List/Tuples**

In [41]:
# Dataframe dari Dictionary
D = {'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
    'Age' : [23, 21, 22, 21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU']} 
df = pd.DataFrame(D)
df

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [42]:
# Dataframe dari List
Name = ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi']
Age = [23, 21, 22, 21]
University = ['BHU', 'JNU', 'DU', 'BHU'] 
df = pd.DataFrame(zip(Name, Age, University), columns=['Name', 'Age', 'University'])
df

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [43]:
# # Slicing index bekerja seperti List, tapi harus hati-hati.
print(df.index)
df[1:3]

RangeIndex(start=0, stop=4, step=1)

        Name  Age University
1  Aishwarya   21        JNU
2    Shaurya   22         DU

# <center><font color="blue"> OK, Let's Start!: Import-Loading Data</font></center>

<center><img alt="" src="images/meme-cartoon/Reading-and-Writing-Data-With-Pandas.jpg" style="height: 300px;" /></center>

# <center><font color="blue"> Studi Kasus</font></center>

* Sumber Data: http://byebuyhome.com/
* Objective: menemukan harga rumah yang berada di bawah pasaran untuk melakukan investasi.
* Variable:
 - **Dist_Taxi** – distance to nearest taxi stand from the property
 - **Dist_Market** – distance to nearest grocery market from the property
 - **Dist_Hospital** – distance to nearest hospital from the property
 - **Carpet** – carpet area of the property in square feet
 - **Builtup** – built-up area of the property in square feet
 - **Parking** – type of car parking available with the property
 - **City_Category** – categorization of the city based on the size
 - **Rainfall** – annual rainfall in the area where property is located
 - **House_Price** – price at which the property was sold

<img alt="" src="images/property-investment-analysis.jpg" style="height: 250px;" />

# <center><font color="blue"> Import-Loading Data CSV / Excel Data via Pandas</font></center>

<img alt="" src="images/pandas load csv excel.png" style="height: 150px;" />

* Importing CSV file  https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* Encodings https://docs.python.org/3/library/codecs.html#standard-encodings

In [44]:
file_ = 'data/price.csv'
try: # Running Locally, yakinkan "file_" berada di folder "data"
    price = pd.read_csv(file_)
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudataanalytics/taudata-Academy/master/data/price.csv
    price = pd.read_csv(file_)
    
N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

baris =  936 , Kolom (jumlah variabel) =  10
Tipe Variabe df =  <class 'pandas.core.frame.DataFrame'>

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000
3,4,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000
4,5,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000
...,...,...,...,...,...,...,...,...,...,...
931,932,9297.0,12537.0,14418.0,1174.0,1429.0,Covered,CAT C,1110,5434000
932,933,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
933,934,9205.0,10418.0,14496.0,1118.0,1337.0,Open,CAT A,560,7227000
934,935,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
935,936,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000

# <center><font color="blue"> Bagaimana dengan File Excel?</font></center>
## <font color="green"> Karena deprecated support, maka harus install module "openpyxl" terlebih dahulu</font>

* Importing Excel file  https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* openpyxl https://openpyxl.readthedocs.io/en/stable/
<center><img alt="" src="images/meme-cartoon/openpyxl.jpg" style="height: 300px;" /></center>

In [45]:
!pip install openpyxl --q

In [46]:
file_ = 'data/price.xlsx'
try: # Running Locally 
    xl = pd.ExcelFile(file_)
except: # Running in Google Colab
    !mkdir data
    !wget -P data/ https://raw.githubusercontent.com/taudataanalytics/taudata-Academy/master/{file_}
    xl = pd.ExcelFile(file_, engine = 'openpyxl')

sheets_ = xl.sheet_names
print(sheets_)
price = xl.parse(sheets_[0], header=0) #biasakan tidak menulis nama sheet secara langsung

N, P = price.shape # Ukuran Data
print('baris = ', N, ', Kolom (jumlah variabel) = ', P)
print("Tipe Variabe df = ", type(price))
price

['price1', 'price2']
baris =  936 , Kolom (jumlah variabel) =  10
Tipe Variabe df =  <class 'pandas.core.frame.DataFrame'>

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000
3,4,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000
4,5,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000
...,...,...,...,...,...,...,...,...,...,...
931,932,9297.0,12537.0,14418.0,1174.0,1429.0,Covered,CAT C,1110,5434000
932,933,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
933,934,9205.0,10418.0,14496.0,1118.0,1337.0,Open,CAT A,560,7227000
934,935,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
935,936,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000

# <center><font color="blue"> Prefer XLS atau CSV di Data Science/Machine Learning/AI</font></center><br><font color="green">Mengapa?</font>

<center><img alt="" src="images/excel_error.png" style="height: 300px;" /></center>

In [47]:
# "Mengintip" beberapa data pertamanya
price.head(7)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000
3,4,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000
4,5,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000
5,6,6665.0,5142.0,9972.0,1442.0,1733.0,Open,CAT B,760,4526000
6,7,13153.0,11869.0,17811.0,1542.0,1858.0,No Parking,CAT A,1030,7224000

In [48]:
# Tips ... Gunakan Transpose untuk High-Dimensional Data (data dengan banyak kolom/variabel)
price.head().transpose()

                     0             1             2        3             4
Observation          1             2             3        4             5
Dist_Taxi       9796.0        8294.0       11001.0   8301.0       10510.0
Dist_Market     5250.0        8186.0       14399.0  11188.0       12629.0
Dist_Hospital  10703.0       12694.0       16991.0  12289.0       13921.0
Carpet          1659.0        1461.0        1340.0   1451.0        1770.0
Builtup         1961.0        1752.0        1609.0   1748.0        2111.0
Parking           Open  Not Provided  Not Provided  Covered  Not Provided
City_Category    CAT B         CAT B         CAT A    CAT B         CAT B
Rainfall           530           210           720      620           450
House_Price    6649000       3982000       5401000  5373000       4662000

In [49]:
# "Mengintip" beberapa data akhirnya
price.tail(7)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
929,930,7423.0,11708.0,13220.0,1200.0,1436.0,Open,CAT A,1060,7644000
930,931,15082.0,14700.0,19617.0,1299.0,1560.0,Open,CAT B,770,9661000
931,932,9297.0,12537.0,14418.0,1174.0,1429.0,Covered,CAT C,1110,5434000
932,933,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
933,934,9205.0,10418.0,14496.0,1118.0,1337.0,Open,CAT A,560,7227000
934,935,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000
935,936,10915.0,17486.0,15964.0,1549.0,1851.0,Not Provided,CAT C,1220,7062000

In [50]:
# chosen at random
price.sample(10)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price
532,533,5584.0,10514.0,11003.0,1244.0,1477.0,No Parking,CAT B,890,2784000
179,180,4692.0,5460.0,7531.0,1343.0,1599.0,Open,CAT B,870,4491000
90,91,7566.0,9599.0,16454.0,1287.0,1525.0,Not Provided,CAT A,1200,9018000
458,459,13925.0,14473.0,17746.0,1513.0,1820.0,Open,CAT B,520,6602000
441,442,7807.0,9674.0,12678.0,1161.0,1404.0,Covered,CAT C,430,5838000
734,735,8701.0,8969.0,12290.0,932.0,1120.0,Covered,CAT B,660,3559000
145,146,4945.0,10098.0,9241.0,1795.0,2187.0,Open,CAT A,300,7653000
455,456,4846.0,9003.0,10135.0,1373.0,1635.0,No Parking,CAT A,840,6104000
780,781,7684.0,7671.0,13192.0,1398.0,1683.0,Open,CAT B,490,4950000
679,680,9823.0,13861.0,14579.0,1334.0,1584.0,Not Provided,CAT B,840,5720000

# <center><font color="blue"> "loc" VS "iloc" in Pandas Dataframe</font></center>

<center><img alt="" src="images/dataframe loc iloc.png" style="height: 350px;" /></center>

In [51]:
# Ganti "N" dengan index pertama di df_train
N = 390
try:
    print(price.loc[N]) 
except:
    print("Yakinkan nilai N adalah index pertama di df_train")

Observation             391
Dist_Taxi            9689.0
Dist_Market         10159.0
Dist_Hospital       11554.0
Carpet               1876.0
Builtup              2254.0
Parking          No Parking
City_Category         CAT C
Rainfall               1340
House_Price         2165000
Name: 390, dtype: object

In [52]:
price.iloc[0]['Parking']

'Open'

# <center><font color="blue"> Iterating on dataframe (Sangat Penting)</font></center>
### <font color="green"> Banyak yang tidak menyarankan, tapi banyak situasi di dunia nyata yang memaksa kita melakukan hal ini.</font>

<center><img alt="" src="images/pandas iteration.png" style="height: 350px;" /></center>
    
* https://www.dataindependent.com/pandas/pandas-iterate-over-rows/

In [53]:
# Kita juga meng-iterasikan sebuah dataframe (jika diperlukan)
price['total_jarak'] = [0]*price.shape[0]
for i, d in price.iterrows():
    price['total_jarak'].loc[i] = d.Dist_Taxi + d.Dist_Market + d.Dist_Hospital

price.head().transpose()

                     0             1             2        3             4
Observation          1             2             3        4             5
Dist_Taxi       9796.0        8294.0       11001.0   8301.0       10510.0
Dist_Market     5250.0        8186.0       14399.0  11188.0       12629.0
Dist_Hospital  10703.0       12694.0       16991.0  12289.0       13921.0
Carpet          1659.0        1461.0        1340.0   1451.0        1770.0
Builtup         1961.0        1752.0        1609.0   1748.0        2111.0
Parking           Open  Not Provided  Not Provided  Covered  Not Provided
City_Category    CAT B         CAT B         CAT A    CAT B         CAT B
Rainfall           530           210           720      620           450
House_Price    6649000       3982000       5401000  5373000       4662000
total_jarak    25749.0       29174.0       42391.0  31778.0       37060.0

In [54]:
# Apply menggunakan "cython" sehingga lebih cepat
price['harga_jual'] = price['House_Price'].apply(lambda x: x + 250000)
# akan ada kolom baru di dataframe "price"
price.head(3)

,Observation,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
0,1,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000,25749.0,6899000
1,2,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
2,3,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000,42391.0,5651000

# <center><font color="blue"> Removing variable(s) & Fixing Variable Type(s)</font></center>

<center><img alt="" src="images/pandas-dataframe-drop.png" style="height: 350px;" /></center>

In [55]:
# perhatikan perintahnya tidak menggunakan tanda "()" ==> Properties 
price.columns

Index(['Observation', 'Dist_Taxi', 'Dist_Market', 'Dist_Hospital', 'Carpet',
       'Builtup', 'Parking', 'City_Category', 'Rainfall', 'House_Price',
       'total_jarak', 'harga_jual'],
      dtype='object')

In [56]:
# Drop kolom pertama karena tidak berguna (hanya "observation" ~ index)
try: # Good practice untuk selalu gunakan Try-Except saat melakukan "drop" ... mengapa?
    price.drop(["Observation"], axis=1, inplace=True) # Parameter "inplace=True" penting saat datanya besar.
except Exception as err_:
    print(err_)
    
print(price.columns)
price.head(3)

Index(['Dist_Taxi', 'Dist_Market', 'Dist_Hospital', 'Carpet', 'Builtup',
       'Parking', 'City_Category', 'Rainfall', 'House_Price', 'total_jarak',
       'harga_jual'],
      dtype='object')

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
0,9796.0,5250.0,10703.0,1659.0,1961.0,Open,CAT B,530,6649000,25749.0,6899000
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
2,11001.0,14399.0,16991.0,1340.0,1609.0,Not Provided,CAT A,720,5401000,42391.0,5651000

In [57]:
# Contoh hapus baris ke-1 dan ke-3
price.drop(price.index[[0,2]], inplace=True) # sengaja tidak menggunakan "inplace=True" ... perhatikan hasil cell setelah ini

In [58]:
price.head(4) # Apa yang terjadi?

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
3,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000,31778.0,5623000
4,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000,37060.0,4912000
5,6665.0,5142.0,9972.0,1442.0,1733.0,Open,CAT B,760,4526000,21779.0,4776000

In [59]:
# di machine learning/AI/Data Science memahami Struktur Data adalah kunci penting untuk memahaminya
print( "type = ", type(price.index[[0,2]]),  "\nvalue = ",price.index[[0,2]]) 
# drop by int "index" kalau rows & nama column+axis=1 jika drop kolom

type =  <class 'pandas.core.indexes.base.Index'>
value =  Index([1, 4], dtype='int64')

In [60]:
# delete Rows dengan kondisi
price.drop(price[(price.House_Price > 6500000) & (price.House_Price < 9000000)].index, inplace=True)
# untuk mengingatnya, bayangkan saja "parameter" dari drop adalah int index seperti di penjelasan cell sebelumnya
print(price.shape)
price.head(7)

(610, 11)

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,City_Category,Rainfall,House_Price,total_jarak,harga_jual
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,CAT B,210,3982000,29174.0,4232000
3,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,CAT B,620,5373000,31778.0,5623000
4,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,CAT B,450,4662000,37060.0,4912000
5,6665.0,5142.0,9972.0,1442.0,1733.0,Open,CAT B,760,4526000,21779.0,4776000
7,5882.0,9948.0,13315.0,1261.0,1507.0,Open,CAT C,1020,3772000,29145.0,4022000
8,7495.0,11589.0,13370.0,1090.0,1321.0,Not Provided,CAT B,680,4631000,32454.0,4881000
9,8233.0,7067.0,11400.0,1030.0,1235.0,Open,CAT C,1130,4415000,26700.0,4665000

# <center><font color="blue"> Mengoreksi Tipe variabel: "dtype" & "info"</font></center>

### <font color="green"> Salah satu kunci penting dalam memahami ML/AI/Data Science baik Teori maupun aplikasinya adalah "Struktur Data"</font>
    
<center><img alt="" src="images/pandas_dtypes.png" style="height: 350px;" /></center>

In [61]:
# tipe data di setiap kolom
# Wajib di periksa apakah tipe datanya sudah tepat?
# Perhatikan df sebagaimana semua variable di Python diperlakukan seperti object
price.info()

<class 'pandas.core.frame.DataFrame'>
Index: 610 entries, 1 to 931
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Dist_Taxi      603 non-null    float64
 1   Dist_Market    603 non-null    float64
 2   Dist_Hospital  609 non-null    float64
 3   Carpet         604 non-null    float64
 4   Builtup        599 non-null    float64
 5   Parking        610 non-null    object
 6   City_Category  610 non-null    object
 7   Rainfall       610 non-null    int64
 8   House_Price    610 non-null    int64
 9   total_jarak    603 non-null    float64
 10  harga_jual     610 non-null    int64
dtypes: float64(6), int64(3), object(2)
memory usage: 57.2+ KB

In [62]:
price.dtypes # less information, tapi perhatikan struktur datanya (more useful).

Dist_Taxi        float64
Dist_Market      float64
Dist_Hospital    float64
Carpet           float64
Builtup          float64
Parking           object
City_Category     object
Rainfall           int64
House_Price        int64
total_jarak      float64
harga_jual         int64
dtype: object

In [63]:
# dataframe types: https://pbpython.com/pandas_dtypes.html
price['Parking'] = price['Parking'].astype('category')
price['City_Category'] = price['City_Category'].astype('category')
price.dtypes

Dist_Taxi         float64
Dist_Market       float64
Dist_Hospital     float64
Carpet            float64
Builtup           float64
Parking          category
City_Category    category
Rainfall            int64
House_Price         int64
total_jarak       float64
harga_jual          int64
dtype: object

# <center><font color="blue"> Variable Type Selection</font></center>
### <font color="green"> Slicing data berdasarkan Tipe sangat penting, karena visualisasi atau algoritma tertentu hanya untuk suatu tipe data tertentu juga.</font>
    
<center><img alt="" src="images/pandas subsetting.png" style="height: 250px;" /></center>

In [64]:
# Jika yang dibutuhkan memang hanya nama kolom, maka kita bisa melakukan hal ini untuk menghemat penggunaan memory
numVar = price.select_dtypes(include = ['float64', 'int64']).columns

numVar.to_list()

['Dist_Taxi',
 'Dist_Market',
 'Dist_Hospital',
 'Carpet',
 'Builtup',
 'Rainfall',
 'House_Price',
 'total_jarak',
 'harga_jual']

In [65]:
# Memilih hanya variable dengan tipe tertentu
numVar = price.select_dtypes(include = ['float64', 'int64'])
numVar.head() # Perhatikan numVar adalah variable df baru! (hati-hati di data yang besar)

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Rainfall,House_Price,total_jarak,harga_jual
1,8294.0,8186.0,12694.0,1461.0,1752.0,210,3982000,29174.0,4232000
3,8301.0,11188.0,12289.0,1451.0,1748.0,620,5373000,31778.0,5623000
4,10510.0,12629.0,13921.0,1770.0,2111.0,450,4662000,37060.0,4912000
5,6665.0,5142.0,9972.0,1442.0,1733.0,760,4526000,21779.0,4776000
7,5882.0,9948.0,13315.0,1261.0,1507.0,1020,3772000,29145.0,4022000

In [66]:
# Memilih hanya variable dengan tipe tertentu
catVar = price.select_dtypes(include = ['object', 'category'])
catVar.head(3)

        Parking City_Category
1  Not Provided         CAT B
3       Covered         CAT B
4  Not Provided         CAT B

In [67]:
# get all unique values of a variable/column
for col in catVar.columns:
    print(col,': ', set(price[col].unique()))

Parking :  {'No Parking', 'Open', 'Not Provided', 'Covered'}
City_Category :  {'CAT A', 'CAT C', 'CAT B'}

# <center><font color="blue"> Memilih variabel-variabel di data secara manual</font></center>

In [68]:
# Choosing some columns manually
X = price[['House_Price','Dist_Market']] # perhatikan ada 2 tanda kurung siku "[[]]"
X.head(3)

   House_Price  Dist_Market
1      3982000       8186.0
3      5373000      11188.0
4      4662000      12629.0

In [69]:
# Slicing DataFrame - Just like query in SQL
price[price["City_Category"] == "CAT B"].drop("City_Category", axis=1).head()

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,Rainfall,House_Price,total_jarak,harga_jual
1,8294.0,8186.0,12694.0,1461.0,1752.0,Not Provided,210,3982000,29174.0,4232000
3,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,620,5373000,31778.0,5623000
4,10510.0,12629.0,13921.0,1770.0,2111.0,Not Provided,450,4662000,37060.0,4912000
5,6665.0,5142.0,9972.0,1442.0,1733.0,Open,760,4526000,21779.0,4776000
8,7495.0,11589.0,13370.0,1090.0,1321.0,Not Provided,680,4631000,32454.0,4881000

In [70]:
# Slicing DataFrame - Just like query in SQL
X = price[price["Parking"].isin(["Open","Covered"])]
X = X[X["City_Category"] == "CAT B"].drop("City_Category", axis=1)
X.head()

,Dist_Taxi,Dist_Market,Dist_Hospital,Carpet,Builtup,Parking,Rainfall,House_Price,total_jarak,harga_jual
3,8301.0,11188.0,12289.0,1451.0,1748.0,Covered,620,5373000,31778.0,5623000
5,6665.0,5142.0,9972.0,1442.0,1733.0,Open,760,4526000,21779.0,4776000
12,7693.0,9130.0,14684.0,1746.0,2064.0,Open,1050,6047000,31507.0,6297000
13,5236.0,10853.0,13054.0,1615.0,1931.0,Covered,1160,5913000,29143.0,6163000
17,6698.0,11519.0,13441.0,1703.0,2045.0,Covered,670,3817000,31658.0,4067000

In [71]:
url = 'https://en.wikipedia.org/wiki/The_World%27s_Billionaires'
df_list = pd.read_html(url) # Hati-hati ini List!
print(len(df_list))

ImportError: Missing optional dependency 'lxml'.  Use pip or conda to install lxml.

In [ ]:
df_list[0]

In [ ]:
df = df_list[2]
df.head()

In [ ]:
# Memilih Tabel tertentu
pd.read_html(url, match='Number and combined net worth of billionaires by year')[0].head()

<center><h1><strong><font color="blue"> Data Wrangling</font></strong></h1></center>

* Data wrangling adalah proses mengubah data mentah menjadi bentuk yang dapat digunakan. Ini juga dapat disebut sebagai data munging.

* Data wrangling menggambarkan serangkaian proses yang dirancang untuk mengeksplorasi, mengubah, dan memvalidasi dataset mentah dari bentuk yang kotor dan kompleks menjadi data berkualitas tinggi. Kita dapat menggunakan data yang telah diwrangling untuk menghasilkan wawasan berharga dan membimbing keputusan bisnis.

* Data Wrangling bersifat iteratif.

<img alt="" src="images/data-wrangling.jpg"/>

<center><h1><strong><font color="blue"> Core data wrangling types </font></strong></h1></center>

<img alt="" src="images/Data-Wrangling-Types.png"/>

<center><h1><strong><font color="blue"> Hierarchical Indexing </font></strong></h1></center>

* Hierarchical indexing is an important feature of pandas that enables you to have multiple (two or more) index levels on an axis
* Source: [2]

<img alt="" src="images/Hierarchical-index-in-Pandas-dataframe.png"/>

In [72]:
data = pd.DataFrame(data=np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

            0
a 1 -2.337087
  2 -1.351232
  3 -0.950834
b 1  0.548364
  3  0.603041
c 1 -0.169718
  2 -0.847060
d 2 -1.446852
  3 -0.045213

In [73]:
data.loc['a'].loc[1]

0   -2.337087
Name: 1, dtype: float64

In [74]:
data.iloc[0]

0   -2.337087
Name: (a, 1), dtype: float64

In [75]:
data.loc[['b', 'd', 'a']] # Perhatikan jumlah kurung siku!....

            0
b 1  0.548364
  3  0.603041
d 2 -1.446852
  3 -0.045213
a 1 -2.337087
  2 -1.351232
  3 -0.950834

In [76]:
data.loc['b' : 'd'] # Perhatikan jumlah kurung siku!.... Saat slicing berbeda!.

            0
b 1  0.548364
  3  0.603041
c 1 -0.169718
  2 -0.847060
d 2 -1.446852
  3 -0.045213

# Hati-hati ... pemanggilan index sedikit berbeda di "Series"

In [77]:
data2 = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data2['b']

1    1.192860
3    0.394684
dtype: float64

In [78]:
data2.loc[:, 2] # HAti-hati ... ini error jika "data2" berupa Dataframe!...

a    0.199401
c    1.745568
d    0.745042
dtype: float64

<center><h1><strong><font color="blue"> Hierarchical Indexing untuk Apa?</font></strong></h1></center>

Hierarchical indexing plays an important role in reshaping data and group-based
operations like forming a pivot table. For example, you could rearrange the data into
a DataFrame using its unstack method

<img alt="" src="images/stack-unstack-in-Pandas-dataframe.png"/>

In [79]:
data

            0
a 1 -2.337087
  2 -1.351232
  3 -0.950834
b 1  0.548364
  3  0.603041
c 1 -0.169718
  2 -0.847060
d 2 -1.446852
  3 -0.045213

In [80]:
data.unstack()

          0
          1         2         3
a -2.337087 -1.351232 -0.950834
b  0.548364       NaN  0.603041
c -0.169718 -0.847060       NaN
d       NaN -1.446852 -0.045213

In [81]:
data.unstack().stack() # Perhatikan struktur datanya

            0
a 1 -2.337087
  2 -1.351232
  3 -0.950834
b 1  0.548364
  3  0.603041
c 1 -0.169718
  2 -0.847060
d 2 -1.446852
  3 -0.045213

# Rename Index (for clarity)

In [82]:
data = np.arange(12).reshape((4, 3))
data

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [83]:
frame = pd.DataFrame(data,
    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
    columns=[['Ohio', 'Ohio', 'Colorado'],
    ['Green', 'Red', 'Green']])

frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [84]:
# Pahami kedua perintah ini sebagai perubahan property di Object "frame"! ... 
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [85]:
# Memilih Groups of Colums
# Sangat memudahkan EDA nantinya ==> Sudah bukan DA cupu lagi.
frame['Ohio'].describe()

color     Green        Red
count  4.000000   4.000000
mean   4.500000   5.500000
std    3.872983   3.872983
min    0.000000   1.000000
25%    2.250000   3.250000
50%    4.500000   5.500000
75%    6.750000   7.750000
max    9.000000  10.000000

<center><h1><strong><font color="blue"> Reordering and Sorting Levels </font></strong></h1></center>

In [86]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [87]:
# Bisa juga diurutkan
frame.sort_index(level=1) # Ganti "1" dengan "0" untuk memahami operasi ini.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

<center><h1><strong><font color="blue"> Indexing with a DataFrame’s columns </font></strong></h1></center>

## Pada data di dunia nyata anda akan sering membutuhkan ini

In [88]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
     'c': ['one', 'one', 'one', 'two', 'two',
     'two', 'two'],
     'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [89]:
frame2 = frame.set_index(['c', 'd']) # ==> Membuat index berdasarkan nilai dari kolom "c" dan "d"
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [90]:
frame2.loc['one'].loc[1:2].describe()

              a         b
count  2.000000  2.000000
mean   1.500000  5.500000
std    0.707107  0.707107
min    1.000000  5.000000
25%    1.250000  5.250000
50%    1.500000  5.500000
75%    1.750000  5.750000
max    2.000000  6.000000

In [91]:
frame.set_index(['c', 'd'], drop=False) # Kalau kita ingin c dan d tetap ada (not sure why u want this)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [92]:
# Reset Index biasanya dibutuhkan saat kita sudah banyak melakukan perubahan di DF-nya
# Atau selesai melakukan data PreProcessing/EDA
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

<center><h1><strong><font color="blue"> Combining and Merging Datasets </font></strong></h1></center>

<img alt="" src="images/join-in-Pandas-dataframe.png"/>

Ada 3 macam:
* pandas.merge connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.
* pandas.concat concatenates or “stacks” together objects along an axis.
* The combine_first instance method enables splicing together overlapping data to fill in missing values in one object with values from another.

<center><h1><strong><font color="blue"> Database-Style DataFrame Joins (Merge/Join) </font></strong></h1></center>

In [93]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
     'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [94]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
    'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

# many-to-one join

the data in df1 has multiple rows labeled a
and b, whereas df2 has only one row for each value in the key column. Calling merge
with these objects we obtain:

## Data Mana yang Hilang? Mengapa?

In [95]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

# Bagaimana jika nama kolom berbeda?

In [96]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
    'data1': range(7)})
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [97]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
    'data2': range(3)})

df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [98]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [99]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')[['lkey', 'data1', 'data2']]

  lkey  data1  data2
0    b      0      1
1    b      1      1
2    a      2      0
3    a      4      0
4    a      5      0
5    b      6      1

# Inner join

You may notice that the 'c' and 'd' values and associated data are missing from the
result. By default merge does an 'inner' join; the keys in the result are the intersec‐
tion, or the common set found in both tables.

<img alt="" src="images/join-in-Pandas-dataframe.png"/>

# Outer Join

Other possible options are 'left', 'right', and 'outer'. The outer join takes the union of the keys, combining the
effect of applying both left and right joins:

In [100]:
pd.merge(df1, df2, how='outer') # Perhatikan outputnya.

  key  data1  data2
0   a    2.0    0.0
1   a    4.0    0.0
2   a    5.0    0.0
3   b    0.0    1.0
4   b    1.0    1.0
5   b    6.0    1.0
6   c    3.0    NaN
7   d    NaN    2.0

# Many-to-many merges 

* well-defined, though not necessarily intuitive, behavior
* Many-to-many joins form the Cartesian product of the rows.

In [101]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
     'data1': range(6)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [102]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
    'data2': range(5)})

df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [103]:
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

Since there were three
'b' rows in the left DataFrame and two in the right one, there are six 'b' rows in the
result. The join method only affects the distinct key values appearing in the result:

In [104]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

<center><h1><strong><font color="blue"> merge with multiple keys </font></strong></h1></center>

* When you’re joining columns-on-columns, the indexes on the
passed DataFrame objects are discarded.

In [105]:
df1 = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
    'key2': ['one', 'two', 'one'],
    'lval': [1, 2, 3]})
df1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [106]:
df2 = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
     'key2': ['one', 'one', 'one', 'two'],
     'rval': [4, 5, 6, 7]})
df2

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [107]:
pd.merge(df1, df2, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one   3.0   6.0
1  bar  two   NaN   7.0
2  foo  one   1.0   4.0
3  foo  one   1.0   5.0
4  foo  two   2.0   NaN

# overlapping column names

* While you can address the overlap manually (Rename nama kolom), merge has a suffixes option for specifying strings to append to overlapping names in the left and right DataFrame objects

In [108]:
pd.merge(df1, df2, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [109]:
pd.merge(df1, df2, on='key1', suffixes=('_satu', '_dua'))

  key1 key2_satu  lval key2_dua  rval
0  foo       one     1      one     4
1  foo       one     1      one     5
2  foo       two     2      one     4
3  foo       two     2      one     5
4  bar       one     3      one     6
5  bar       one     3      two     7

<center><h1><strong><font color="blue"> Merging on Index </font></strong></h1></center>

In [110]:
df1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
    'value': range(6)})
df1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [111]:
df2 = pd.DataFrame({'group_val': [35, 7]}, index=['a', 'b'])
df2

   group_val
a         35
b          7

In [112]:
pd.merge(df1, df2, left_on='key', right_index=True)

  key  value  group_val
0   a      0         35
1   b      1          7
2   a      2         35
3   a      3         35
4   b      4          7

# Concatenating Along an Axis

In [113]:
# Concat di DataFrame

df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
    columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [114]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'],
    columns=['three', 'four'])
df2

   three  four
a      5     6
c      7     8

In [115]:
pd.concat([df1, df2], axis=1) # , keys=['level1', 'level2']
#Perhatikan indexnya

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

<center><h1><strong><font color="blue"> Data Aggregation and Group Operations </font></strong></h1></center>

<img alt="" src="images/Aggregrate-Groups-Pandas-dataframe.png"/>

* pandas provides a flexible groupby interface, enabling you to slice, dice, and summarize datasets in a natural way.
* Aggregation of time series data, a special use case of groupby, is referred to as resampling.

<center><h1><strong><font color="blue"> 1. GroupBy Mechanics </font></strong></h1></center>

<img alt="" src="images/Split-Apply-Combine-Pandas-dataframe.png"/>

* Hadley Wickham, an author of many popular packages for the R programming lan‐
guage, coined the term split-apply-combine for describing group operations.

In [116]:
import pandas as pd , numpy as np

df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
    'key2' : ['one', 'two', 'one', 'two', 'one'],
    'data1' : [1,2,3,4,5],
    'data2' : [6,7,8,9,10]})
df

  key1 key2  data1  data2
0    a  one      1      6
1    a  two      2      7
2    b  one      3      8
3    b  two      4      9
4    a  one      5     10

In [117]:
grouped = df.groupby(df['key1']).sum()
grouped

           key2  data1  data2
key1
a     onetwoone      8     23
b        onetwo      7     17

In [118]:
grouped = df['data1 data2'.split()].groupby(df['key1']).mean()
grouped

         data1     data2
key1
a     2.666667  7.666667
b     3.500000  8.500000

In [119]:
grouped[['data1', 'data2']].mean()

data1    3.083333
data2    8.083333
dtype: float64

In [120]:
means = df.groupby([df['key1'], df['key2']]).mean()
means

           data1  data2
key1 key2
a    one     3.0    8.0
     two     2.0    7.0
b    one     3.0    8.0
     two     4.0    9.0

In [121]:
means.loc['a'].loc['one'].describe()

count    2.000000
mean     5.500000
std      3.535534
min      3.000000
25%      4.250000
50%      5.500000
75%      6.750000
max      8.000000
Name: one, dtype: float64

In [122]:
df[['key1', 'data1', 'data2']].groupby('key1').mean()

# You may have noticed in the first case df.groupby('key1').mean() that there is no key2 column in the result. 
# Because df['key2'] is not numeric data, it is said to be a nuisance column, which is therefore excluded from the result.

         data1     data2
key1
a     2.666667  7.666667
b     3.500000  8.500000

In [123]:
# Walau pada data numerik terkadang kita ingin mengetahui jumlah kejadiannya (frekuensi)
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

# GroupBy bisa flexible dengan memilih grouping berdasarkan kolom mana saja

* Sekalian rename hasil groupBy-nya

In [124]:
people = pd.DataFrame(np.random.randn(5, 5),
    columns=['a', 'b', 'c', 'd', 'e'],
    index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe    -0.826895  0.135516  0.446968 -2.475652  0.404186
Steve  -1.881297  0.456340 -0.808784  2.965088  0.669274
Wes     1.385320 -0.207318 -1.508573 -1.989894 -1.061950
Jim     0.351712 -1.037848 -0.391957 -0.366046 -1.723381
Travis  1.632800 -0.584567 -0.532066 -0.523858  0.880970

In [125]:
d = {'a': 'takeHomePay', 'b': 'takeHomePay', 'c': 'blue', 'd': 'blue', 'e': 'takeHomePay', 'f' : 'orange'}
d

{'a': 'takeHomePay',
 'b': 'takeHomePay',
 'c': 'blue',
 'd': 'blue',
 'e': 'takeHomePay',
 'f': 'orange'}

In [126]:
people.groupby(d, axis=1).sum()

            blue  takeHomePay
Joe    -2.028684    -0.287193
Steve   2.156304    -0.755682
Wes    -3.498467     0.116052
Jim    -0.758003    -2.409517
Travis -1.055924     1.929203

<center><h1><strong><font color="blue"> Data Aggregation </font></strong></h1></center>

<img alt="" src="images/GroupBy-Pandas-dataframe.png"/>

* Aggregations refer to any data transformation that produces scalar values from
arrays. 
* Tidak hanya fungsi yang ditabel diatas

In [127]:
df

  key1 key2  data1  data2
0    a  one      1      6
1    a  two      2      7
2    b  one      3      8
3    b  two      4      9
4    a  one      5     10

In [128]:
df[['key1','data1','data2']].groupby('key1').quantile(0.9)

      data1  data2
key1
a       4.4    9.4
b       3.9    8.9

# Custom Aggregate Function 

### Perhatikan, ini sangat penting untuk diketahui

In [129]:
def RangeData(arr):
    return arr.max() - arr.min()

In [130]:
df[['key1','data1','data2']].groupby('key1').agg(RangeData)

      data1  data2
key1
a         4      4
b         1      1

# Apply di Dataframe

* Sangat penting juga untuk mengefisienkan Code

In [131]:
def sum_kuadrat(x):
    return x.sum()**2+1

data = {
  "x": [5, 4, 3],
  "y": [2, 1, 7]
}
df = pd.DataFrame(data)
df

   x  y
0  5  2
1  4  1
2  3  7

In [132]:
df.apply(sum_kuadrat)

x    145
y    101
dtype: int64

<center><h1><strong><font color="blue"> Pivot Tables and Cross-Tabulation </font></strong></h1></center>

A pivot table is a data summarization tool frequently found in spreadsheet programs
and other data analysis software. It aggregates a table of data by one or more keys,
arranging the data in a rectangle with some of the group keys along the rows and
some along the columns. Pivot tables in Python with pandas are made possible
through the groupby

In [133]:
tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [134]:
tips[['day', 'smoker','tip','total_bill']].pivot_table(index=['day', 'smoker'])

                  tip  total_bill
day  smoker
Thur Yes     3.030000   19.190588
     No      2.673778   17.113111
Fri  Yes     2.714000   16.813333
     No      2.812500   18.420000
Sat  Yes     2.875476   21.276667
     No      3.102889   19.661778
Sun  Yes     3.516842   24.120000
     No      3.167895   20.506667

# CrossTab

* A cross-tabulation (or crosstab for short) is a special case of a pivot table that computes group frequencies.

In [135]:
pd.crosstab(tips.day, tips.smoker)

smoker  Yes  No
day
Thur     17  45
Fri      15   4
Sat      42  45
Sun      19  57

<center><h2><strong><font color="blue">End of Module</font></strong></h2></center>
<hr>
<center><img alt="" src="images/meme-cartoon/pandas-meme.jpg"/></center>
<center><img alt="" src="images/meme-cartoon/data-wrangling-meme.jpg"/></center>

# Referensi:

1. Rattenbury, Tye, et al. Principles of data wrangling: Practical techniques for data preparation. " O'Reilly Media, Inc.", 2017.

2. McKinney, Wes. Python for data analysis: Data wrangling with Pandas, NumPy, and IPython. " O'Reilly Media, Inc.", 2012.